app/controllers/books_controller.rb

INSERT INTO "books" ("title", "author", "created_at", "updated_at", "user_id", "status") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Zoo"], ["author", "James Paterson"], ["created_at", "2017-09-26 19:51:59.255769"], ["updated_at", "2017-09-26 19:51:59.255769"], ["user_id", 5], ["status", "I recommend this book"]]
---
  def create
    # @book = Book.new(book_params)
    @book = current_user.books.build(book_params)

    if @book.save

UPDATE "books" SET "title" = $1, "author" = $2, "updated_at" = $3 WHERE "books"."id" = $4  [["title", "Game of Thrones"], ["author", "George R.R. Martin"], ["updated_at", "2017-09-23 23:51:10.203062"], ["id", 1]]
---
  def update
    if @book.update(book_params)

SELECT  "books".* FROM "books" WHERE "books"."user_id" = $1 AND "books"."id" = $2 LIMIT $3  [["user_id", 5], ["id", 37], ["LIMIT", 1]]
---
  def set_book
    # @book = Book.find(params[:id])
    @book = current_user.books.find(params[:id])